Pregaine/WV08048ERN070G/library/Device/Holtek/HT32F12365_66/Include/ht32f12365_66.h
/**
 * @brief Universal Serial Bus Endpoint
 */
typedef struct
{
                                 /* USB Endpoint0: 0x400A8014                                               */
                                 /* USB Endpoint1: 0x400A8028                                               */
                                 /* USB Endpoint2: 0x400A803C                                               */
                                 /* USB Endpoint3: 0x400A8050                                               */
                                 /* USB Endpoint4: 0x400A8064                                               */
                                 /* USB Endpoint5: 0x400A8078                                               */
                                 /* USB Endpoint6: 0x400A808C                                               */
                                 /* USB Endpoint7: 0x400A80A0                                               */
  __IO uint32_t CSR;             /*!< 0x000 USB Endpoint n Control and Status Register                      */
  __IO uint32_t IER;             /*!< 0x004 USB Endpoint n Interrupt Enable Register                        */
  __IO uint32_t ISR;             /*!< 0x008 USB Endpoint n Interrupt Status Register                        */
  __IO uint32_t TCR;             /*!< 0x00C USB Endpoint n Transfer Count Register                          */
  __IO uint32_t CFGR;            /*!< 0x010 USB Endpoint n Configuration Register                           */
} HT_USBEP_TypeDef;


/**
 * @brief External Bus Interface
 */
typedef struct
{
                                 /* EBI: 0x40098000                                                         */
  __IO uint32_t CR;              /*!< 0x000    EBI Control Register                                         */
  __IO uint32_t PCR;             /*!< 0x004    EBI Page Control Register                                    */
  __IO uint32_t SR;              /*!< 0x008    EBI Status Register                                          */
       uint32_t RESERVED0[1];    /*!< 0x00C    Reserved                                                     */
  __IO uint32_t ATR0;            /*!< 0x010    EBI Address Timing Register 0                                */
  __IO uint32_t RTR0;            /*!< 0x014    EBI Read Timing Register 0                                   */
  __IO uint32_t WTR0;            /*!< 0x018    EBI Write Timing Register 0                                  */
  __IO uint32_t PR0;             /*!< 0x01C    EBI Parity Register 0                                        */
  __IO uint32_t ATR1;            /*!< 0x020    EBI Address Timing Register 1                                */
  __IO uint32_t RTR1;            /*!< 0x024    EBI Read Timing Register 1                                   */
  __IO uint32_t WTR1;            /*!< 0x028    EBI Write Timing Register 1                                  */
  __IO uint32_t PR1;             /*!< 0x02C    EBI Parity Register 1                                        */
  __IO uint32_t ATR2;            /*!< 0x030    EBI Address Timing Register 2                                */
  __IO uint32_t RTR2;            /*!< 0x034    EBI Read Timing Register 2                                   */
  __IO uint32_t WTR2;            /*!< 0x038    EBI Write Timing Register 2                                  */
  __IO uint32_t PR2;             /*!< 0x03C    EBI Parity Register 2                                        */
  __IO uint32_t ATR3;            /*!< 0x040    EBI Address Timing Register 3                                */
  __IO uint32_t RTR3;            /*!< 0x044    EBI Read Timing Register 3                                   */
  __IO uint32_t WTR3;            /*!< 0x048    EBI Write Timing Register 3                                  */
  __IO uint32_t PR3;             /*!< 0x04C    EBI Parity Register 3                                        */
  __IO uint32_t IEN;             /*!< 0x050    EBI Interrupt Enable Register                                */
  __IO uint32_t IF;              /*!< 0x054    EBI Interrupt Flag Register                                  */
  __IO uint32_t IFC;             /*!< 0x058    EBI Interrupt Clear Register                                 */
} HT_EBI_TypeDef;


/**
 * @brief Cyclic Redundancy Check
 */
typedef struct
{
                                  /* CRC: 0x4008A000                                                        */
  __IO uint32_t CR;               /*!< 0x000 CRC Control Register                                           */
  __IO uint32_t SDR;              /*!< 0x004 CRC Seed Register                                              */
  __IO uint32_t CSR;              /*!< 0x008 CRC Checksum Register                                          */
  __IO uint32_t DR;               /*!< 0x00C CRC Data Register                                              */
} HT_CRC_TypeDef;


/**
 * @brief Integrated Interchip Sound
 */
typedef struct
{
                                  /* I2S: 0x40026000                                                        */
  __IO uint32_t CR;               /*!< 0x000 I2S Control Register                                           */
  __IO uint32_t IER;              /*!< 0x004 I2S Interrupt Enable Register                                  */
  __IO uint32_t CDR;              /*!< 0x008 I2S Clock Divider Register                                     */
  __IO uint32_t TXDR;             /*!< 0x00C I2S TX Data Register                                           */
  __IO uint32_t RXDR;             /*!< 0x010 I2S RX Data Register                                           */
  __IO uint32_t FCR;              /*!< 0x014 I2S FIFO Control Register                                      */
  __IO uint32_t SR;               /*!< 0x018 I2S Status Register                                            */
  __IO uint32_t RCNTR;            /*!< 0x01C I2S Rate Counter Register                                      */
} HT_I2S_TypeDef;


/**
 * @brief SDIO
 */
typedef struct
{
                                 /* SDIO: 0x400A0000                                                        */
  __IO uint32_t BLKSIZE;         /*!< 0x000    Block Size Register                                          */
  __IO uint32_t BLKCNT;          /*!< 0x004    Block Count Register                                         */
  __IO uint32_t ARG;             /*!< 0x008    Argument Register                                            */
  __IO uint32_t TRANMODE;        /*!< 0x00C    Transfer Mode Register                                       */
  __IO uint32_t CMD;             /*!< 0x010    Command Register Register                                    */
  __IO uint32_t RESP0;           /*!< 0x014    Response Register 0                                          */
  __IO uint32_t RESP1;           /*!< 0x018    Response Register 1                                          */
  __IO uint32_t RESP2;           /*!< 0x01C    Response Register 2                                          */
  __IO uint32_t RESP3;           /*!< 0x020    Response Register 3                                          */
  __IO uint32_t DR;              /*!< 0x024    Data Register                                                */
  __IO uint32_t PSR;             /*!< 0x028    Present Status Register                                      */
  __IO uint32_t CR;              /*!< 0x02C    Control Register                                             */
  __IO uint32_t BLKGAPCTRL;      /*!< 0x030    Block Gap Register                                           */
  __IO uint32_t WAKEUPCTRL;      /*!< 0x034    Wake Up Control Register                                     */
  __IO uint32_t CLKCR;           /*!< 0x038    Clock Control Register                                       */
  __IO uint32_t TIMEOUT;         /*!< 0x03C    Timeout Register                                             */
  __IO uint32_t SWRST;           /*!< 0x040    Software Reset Register                                      */
  __IO uint32_t SR;              /*!< 0x044    Status Register                                              */
  __IO uint32_t SER;             /*!< 0x048    Status Enable Register                                       */
  __IO uint32_t IER;             /*!< 0x04C    Interrupt Enable Register                                    */
} HT_SDIO_TypeDef;


/**
 * @brief CMOS Sensor Interface
 */
typedef struct
{
                                 /* CSIF: 0x400CC000                                                        */
  __IO uint32_t ENR;             /*!< 0x000    Enable Register                                              */
  __IO uint32_t CR;              /*!< 0x004    Control Register                                             */
  __IO uint32_t IMGWH;           /*!< 0x008    Image Width/Height Register                                  */
  __IO uint32_t WCR0;            /*!< 0x00C    Window Capture 0 Register                                    */
  __IO uint32_t WCR1;            /*!< 0x010    Window Capture 1 Register                                    */
  __IO uint32_t SMP;             /*!< 0x014    Row & Column Sub-Sample Register                             */
  __IO uint32_t SMPCOL;          /*!< 0x018    Column Sub-Sample Register                                   */
  __IO uint32_t SMPROW;          /*!< 0x01C    Row Sub-Sample Register                                      */
  __IO uint32_t FIFO0;           /*!< 0x020    FIFO Register 0                                              */
  __IO uint32_t FIFO1;           /*!< 0x024    FIFO Register 1                                              */
  __IO uint32_t FIFO2;           /*!< 0x028    FIFO Register 2                                              */
  __IO uint32_t FIFO3;           /*!< 0x02C    FIFO Register 3                                              */
  __IO uint32_t FIFO4;           /*!< 0x030    FIFO Register 4                                              */
  __IO uint32_t FIFO5;           /*!< 0x034    FIFO Register 5                                              */
  __IO uint32_t FIFO6;           /*!< 0x038    FIFO Register 6                                              */
  __IO uint32_t FIFO7;           /*!< 0x03C    FIFO Register 7                                              */
  __IO uint32_t IER;             /*!< 0x040    Interrupt Enable Register                                    */
  __IO uint32_t SR;              /*!< 0x044    Status Register                                              */
} HT_CSIF_TypeDef;


/**
 * @brief AES
 */
typedef struct
{
                                 /* AES: 0x400C8000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t SR;              /*!< 0x004         Status Register                                         */
  __IO uint32_t PDMAR;           /*!< 0x008         PDMA Register                                           */
  __IO uint32_t ISR;             /*!< 0x00C         Interrupt Status Register                               */
  __IO uint32_t IER;             /*!< 0x010         Interrupt Enable Register                               */
  __IO uint32_t DINR;            /*!< 0x014         Data Input Register                                     */
  __IO uint32_t DOUTR;           /*!< 0x018         Data Output Register                                    */
  __IO uint32_t KEYR[8];         /*!< 0x01C - 0x038 Key Register 0~7                                        */
  __IO uint32_t IVR[4];          /*!< 0x03C - 0x048 Initial Vector Register 0~3                             */
} HT_AES_TypeDef;


/**
  * @}
  */


/** @addtogroup Peripheral_Memory_Map
  * @{
  */

